// app/content/faq/page.tsx
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "よくあるご質問 (FAQ)",
  description: "サービスに関するよくあるご質問とその回答をまとめました。",
  alternates: {
    canonical: "/content/faq",
  },
};

export default function FaqPage() {
  return (
    <>
      <h1>よくあるご質問 (FAQ)</h1>

      <section>
        <h2>Q. 大人数で使いたいのですが、参加人数に制限はありますか？</h2>
        <p>
          A.
          ご安心ください、参加人数に制限は設けておりません。クラス会、会社の部署全体、大規模イベントなど、何名様でもご利用いただけます！
        </p>
      </section>

      <section>
        <h2>Q. スケジュール調整で、候補の日時はいくつまで設定できますか？</h2>
        <p>
          A.
          候補の日時は、一つのグループ（調整ページ）につき最大10個まで設定可能です。たくさんの候補から最適な日時を効率よく見つけることができます。
        </p>
      </section>

      <section>
        <h2>
          Q. 不要になったグループページ（調整ページ）を削除したいのですが。
        </h2>
        <p>
          A.
          申し訳ございませんが、現在、一度作成したグループページをユーザー様ご自身で削除する機能はご用意しておりません。何卒ご了承ください。
        </p>
      </section>

      <section>
        <h2>
          Q. スマホアプリはありますか？ App Store や Google Play
          で探しても見つかりません。
        </h2>
        <p>
          A. 現在、[幹事くん]
          はWebブラウザ版のみご提供しております。スマートフォンやタブレットからも、特別なアプリをインストールすることなく、Webブラウザ（Safari,
          Chromeなど）経由で快適にご利用いただけます。ホーム画面に追加したり、ブックマークしていただくと便利です。
        </p>
      </section>

      <section>
        <h2>
          Q.
          作成した調整ページのURLを開いても表示されません。どうすればいいですか？
        </h2>
        <p>
          A.
          まず、アクセスしようとしているURL（アドレス）にお間違いがないか、再度ご確認ください（コピー＆ペーストが確実です）。URLが正しいにも関わらず表示されない場合は、一時的にサーバーへのアクセスが集中し、表示が遅れている可能性もございます。少し時間をおいてから再度アクセスをお試しください。
        </p>
      </section>

      <section>
        <h2>Q. 登録したスケジュールや出欠情報はいつまで保存されますか？</h2>
        <p>
          A.
          ご登録いただいたデータ（スケジュール候補、皆様の出欠状況など）について、現状、保存期間に特に制限は設けておりません。お客様が削除しない限り、基本的には永続的に保管されます。また、万が一のシステムトラブル等に備え、定期的なデータのバックアップも実施しておりますので、安心してご利用ください。
        </p>
      </section>
    </>
  );
}
